
<template>
  <div class="about">
    <h1>О нас</h1>
    <div>
      <h3>Социальная платформа для молодёжи: пространство для идей и взаимодействия</h3><br>
<p>
      Команда проекта:
      Милославская Екатерина Николаевна - дизайн граффити
  </p>    
<p>Социальная платформа для молодёжи — это уникальное онлайн-пространство, созданное для того, чтобы объединить активных, инициативных и неравнодушных молодых людей. Основная цель платформы — дать возможность молодёжи реализовать свой потенциал, предлагать и воплощать в жизнь социальные идеи, а также взаимодействовать с различными организациями, которые разделяют их ценности и стремления.</p><br>
<p class="golov">Для чего нужна социальная платформа?</p>
<p>Мир меняется, и молодёжь играет ключевую роль в этих изменениях.Платформа создана для того, чтобы:</p>
<ul>	<li>Дать возможность молодым людям выражать свои идеи и инициативы.</li>
	<li>Объединить единомышленников для совместной работы над социальными проектами.</li>
	<li>Предоставить доступ к ресурсам и поддержке от социальных организаций и правительства региона.</li>
	<li>Вдохновлять на создание позитивных изменений в обществе.</li>
	<li>Наблюдать за новыми арт-объектами – граффити в городе.</li>
</ul><br>
<p class="golov">Что можно делать на платформе?</p><br>
<ol>
	<li> <p class="li">Взаимодействовать с социальными организациями</p>
На платформе представлены различные социальные организации, которые занимаются образованием, экологией, благотворительностью, защитой прав человека и многим другим. Вы можете:
<ul>
  <li>Узнавать об их деятельности.</li>
  <li>Участвовать в их проектах и мероприятиях.</li>
  <li>Получать поддержку для реализации своих идей.</li>
</ul>
</li>
	<li> <p class="li">Предлагать свои социальные идеи</p>
Платформа разделена на тематические разделы, где можно публиковать свои идеи и проекты. Например:
<ul>
<li>Идеи по росписи граффити: предлагай места для новых работ.</li>
<li>Культура и искусство: создавайте инициативы, которые вдохновляют и объединяют людей.</li>
<li>Идеи по благоустройству: предлагайте идеи по благоустройству дворов, парков, скверов, зон отдыха и различных мест в регионе.</li>
</ul>
Каждая идея может быть поддержана другими пользователями, а также получить экспертную оценку и помощь от организаций.
</li>
<li>	<p class="li">Находить единомышленников и создавать команды</p>
Платформа позволяет находить людей с похожими интересами, объединяться в команды и вместе работать над реализацией проектов.</li>
<li>	<p class="li">Связаться с правительством региона.</p>
На платформе есть возможность оставить заявку в правительство региона, а после получить официальный ответ.</li>
<li> <p class="li">Выкладывать новости о культурных и образовательных мероприятиях.</p>
Платформа позволяет делится и обсуждать последние новости о культурных и образовательных мероприятиях, а также наблюдать за реализацией твоих инициатив через новости.</li>
</ol>
<p class="golov">Почему это важно?</p>
<p>Социальная платформа для молодёжи — это не просто инструмент для общения, это пространство для действий. Здесь каждый может стать частью чего-то большего, внести свой вклад в развитие общества и найти поддержку для своих инициатив.</p><br>
<p>Присоединяйтесь к платформе, предлагайте свои идеи, вдохновляйтесь и меняйте мир к лучшему вместе с нами!</p>

    </div>
  </div>
</template>
<style scoped>
h3{
  color: black;
  font-weight: bolder;
}
.golov{
  color: black;
  font-weight: bolder;
}
li{
  color: black;
  margin-bottom: 8px;
  
}
.li{
  color: black;
  font-weight: bolder;
}
p {
  color: black;
}
ul {
  color: black;
}
h1 {
  color: black;
}
</style>