<script setup>
// Используем функцию defineProps для определения входных параметров компонента.
// В данном случае, компонент ожидает получение свойства "msg".
defineProps({
  msg: {
    type: String, // Указываем, что свойство "msg" должно быть строкой.
    required: true // Указываем, что это свойство обязательно должно быть передано в компонент.
  }
})
</script>

<template>
  <!-- Основной блок компонента с классом "greetings" -->
  <div class="greetings">
    <!-- Заголовок h1, который отображает значение свойства "msg".
         Класс "green" может быть использован для дополнительного стиля. -->
    <h1 class="green">{{ msg }}</h1>
    <!-- Подзаголовок h3 с описанием платформы.
         Текст описывает цель платформы для поддержки молодежи в Липецке. -->
    <h3>
      Платформа для поддержки творческих инициатив детей и молодежи в городе Липецк<br>
    </h3>
  </div>
</template>

<style scoped>
/* Стили для заголовка h1 */
h1 {
  font-weight: 500; /* Насыщенность шрифта - средняя (500) */
  font-size: 2.6rem; /* Размер шрифта - 2.6rem */
  top: -10px; /* Смещение заголовка вверх на 10px */
  justify-self: center;
}

/* Стили для подзаголовка h3 */
h3 {
  color: black;
  font-size: 1.2rem; /* Размер шрифта - 1.2rem */
}

/* Стили для заголовков h1 и h3 внутри блока с классом "greetings".
   Текст выравнивается по центру. */
.greetings h1,
.greetings h3 {
  text-align: center;
}

/* Адаптивные стили для экранов с шириной более 1024px */
@media (min-width: 1024px) {
  .greetings h1,
  .greetings h3 {
    text-align: left; /* На больших экранах текст выравнивается по левому краю */
  }
}
</style>